app/Http/Controllers/Admin/InventoryController.php

    public function list(Request $request)
    {
        if (auth('customer')->user() == NULL) {
            return redirect()->route('admin.auth.logout');
        }

        $search = $request['search'];
        $query_param = ['search' => $request['search']];

        if ($request->has('search')) {
            $inventories = Inventory::where(function ($q) use ($search) {
                $q->Where('item_name', 'like', "%{$search}%");
            });
        } else {
            $inventories = Inventory::where('item_name', 'like', "%%");
        }

        $counts = $inventories;
        $inventories = $inventories->orderBy('id', 'ASC')->paginate(Helpers::pagination_limit())->appends($query_param);
---
select * from `inventories` where `item_name` like '%%' order by `id` asc limit 100 offset 0
select count(*) as aggregate from `inventories` where `item_name` like '%%'

                $mainInventory->save();

                // Recursively save subItems
                $this->saveSubItems($mainItem['subItems'], $baseInventoryId, $productGroupId, $mainInventory->id, $category['name']);
---
insert into `inventories` (`base_inventory_id`, `item_name`, `hsn_code`, `stock_category`, `unit`, `worth`, `vendor`, `description`, `model_no`, `gm_code`, `brand_name`, `purchase_price`, `length`, `height`, `width`, `weight`, `volume`, `current`, `power`, `rental_information`, `updated_at`, `created_at`) values (0, 'Item 1', 'HSN Code 1', 'electronics', 'piece', 0, 'vendor_a', '1', '', '', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, '2025-05-26 20:17:27', '2025-05-26 20:17:27')

    private function saveSubItems(array $subItems, string $baseInventoryId, int $productGroupId, int $parentId, string $categoryName)
    {
        foreach ($subItems as $subItem) {
            $inventory = new Inventory();
            $inventory->base_inventory_id = $baseInventoryId;
            $inventory->product_group_id = $productGroupId;
            $inventory->parent_sub_id = $parentId;


            $inventory->item_name = $subItem['name'] ?? null;
            $inventory->hsn_code = $subItem['sku'] ?? null;
            $inventory->stock_category = $categoryName;
            $inventory->unit = $subItem['unit'] ?? null;
            $inventory->worth = $subItem['worth'] ?? 0;
            $inventory->stock_count = $subItem['stock'] ?? 0;
            $inventory->created_at = Carbon::now();
            $inventory->updated_at = Carbon::now();

            $inventory->save();

            // Recursive call for any sub-subItems
            if (!empty($subItem['subItems'])) {
                $this->saveSubItems($subItem['subItems'], $baseInventoryId, $productGroupId, $inventory->id, true, $categoryName);
---
insert into `inventories` (`base_inventory_id`, `item_name`, `hsn_code`, `stock_category`, `unit`, `worth`, `vendor`, `description`, `model_no`, `gm_code`, `brand_name`, `purchase_price`, `length`, `height`, `width`, `weight`, `volume`, `current`, `power`, `rental_information`, `updated_at`, `created_at`) values (24, 'Item 1.1', 'HSN Code 1.1', 'furniture', 'set', 0, 'vendor_b', '', '', '', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, '2025-05-26 20:17:27', '2025-05-26 20:17:27')

    public function edit($id)
    {
        $inventory = Inventory::find($id);
---
select * from `inventories` where `inventories`.`id` = '22' limit 1